Repository: nasemulrona/blood-for-life
Catalog: locale/*/LC_MESSAGES/django.po
Languages: bn

source: Blood Management System
bn: ব্লাড ম্যানেজমেন্ট সিস্টেম

source: Dashboard
bn: ড্যাশবোর্ড

source: Admin Panel
bn: অ্যাডমিন প্যানেল

source: Logout
bn: লগআউট

source: Saving lives through blood donation
bn: রক্তদানের মাধ্যমে জীবন বাঁচানো

source: Powered by nasemulrona
bn: nasemulrona দ্বারা পরিচালিত

source: English
bn: ইংরেজি

source: Join our mission to save lives through blood donation.
bn: রক্তদানের মাধ্যমে জীবন বাঁচানোর আমাদের মিশনে যোগ দিন।

source: Register as a donor or manage blood banks efficiently.
bn: ডোনর হিসেবে নিবন্ধন করুন বা রক্তব্যাংক দক্ষতার সাথে পরিচালনা করুন।

source: Register as Donor
bn: ডোনর হিসেবে নিবন্ধন করুন

source: Login to Dashboard
bn: ড্যাশবোর্ডে লগইন করুন

source: Why Choose Our Platform?
bn: কেন আমাদের প্ল্যাটফর্ম বেছে নিবেন?

source: We make blood donation management simple and efficient
bn: আমরা রক্তদান ব্যবস্থাপনা সহজ এবং দক্ষ করে তুলি

source: Donor Management
bn: ডোনর ব্যবস্থাপনা

source: Easy registration and profile management for blood donors.
bn: রক্তদাতাদের জন্য সহজ নিবন্ধন এবং প্রোফাইল ব্যবস্থাপনা।

source: Track your donation history and requests.
bn: আপনার দানের ইতিহাস এবং অনুরোধগুলি ট্র্যাক করুন।

source: Blood Bank Management
bn: ব্লাড ব্যাংক ব্যবস্থাপনা

source: Comprehensive management of blood banks and inventory.
bn: ব্লাড ব্যাংক এবং ইনভেন্টরির সামগ্রিক ব্যবস্থাপনা।

source: Real-time tracking of blood units.
bn: রক্তের ইউনিটের রিয়েল-টাইম ট্র্যাকিং।

source: Donation Tracking
bn: দান ট্র্যাকিং

source: Track donation requests and history.
bn: দানের অনুরোধ এবং ইতিহাস ট্র্যাক করুন।

source: Easy approval process for administrators.
bn: প্রশাসকদের জন্য সহজ অনুমোদন প্রক্রিয়া।

source: Registered Donors
bn: নিবন্ধিত ডোনর

source: Lives Saved
bn: সংরক্ষিত জীবন

source: Blood Banks
bn: ব্লাড ব্যাংক

source: Support Available
bn: সাপোর্ট উপলব্ধ
